[
    {
        "artist": "Dominick Domingo",
        "border": null,
        "cmc": 4.0,
        "color_identity": [
            "G",
            "R"
        ],
        "colors": [
            "Green",
            "Red"
        ],
        "flavor": null,
        "foreign_names": [
            {
                "flavor": null,
                "imageUrl": "http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=196872&type=card",
                "language": "German",
                "multiverseid": 196872,
                "name": "Blutzopf-Elf",
                "text": "Eile\nKaskade (Wenn du diesen Zauberspruch spielst, entferne solange die oberste Karte deiner Bibliothek ganz aus dem Spiel, bis du eine Karte entfernst, die weniger kostet als diese und die kein Land ist. Du kannst sie spielen, ohne ihre Manakosten zu bezahlen. Lege die so entfernten Karten in zufälliger Reihenfolge unter deine Bibliothek.)"
            },
            {
                "flavor": null,
                "imageUrl": "http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=196727&type=card",
                "language": "Spanish",
                "multiverseid": 196727,
                "name": "Elfo trenzas sangrientas",
                "text": "Prisa.\nCascada. (Cuando juegues este hechizo, remueve del juego las primeras cartas de tu biblioteca hasta que remuevas una carta que no sea tierra que cueste menos. Puedes jugar esa carta sin pagar su coste de maná. Pon las cartas removidas en el fondo de tu biblioteca en un orden aleatorio.)"
            },
            {
                "flavor": null,
                "imageUrl": "http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=196292&type=card",
                "language": "French",
                "multiverseid": 196292,
                "name": "Elfe aux Nattes sanguinolentes",
                "text": "Célérité\nCascade (Quand vous jouez ce sort, retirez de la partie les cartes du dessus de votre bibliothèque jusqu'à ce que vous retiriez une carte non-terrain d'un coût inférieur. Vous pouvez la jouer sans payer son coût de mana. Mettez les cartes retirées au-dessous de la bibliothèque dans un ordre aléatoire.)"
            },
            {
                "flavor": null,
                "imageUrl": "http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=195857&type=card",
                "language": "Italian",
                "multiverseid": 195857,
                "name": "Elfa dalle Trecce Rosse",
                "text": "Rapidità\nCascata (Quando giochi questa magia, rimuovi dal gioco le carte dalla cima del tuo grimorio finché non rimuovi una carta non terra con costo di mana minore. Puoi giocare quella carta senza pagare il suo costo di mana. Metti le altre carte rimosse in fondo al tuo grimorio in ordine casuale.)"
            },
            {
                "flavor": null,
                "imageUrl": "http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=196147&type=card",
                "language": "Japanese",
                "multiverseid": 196147,
                "name": "血編み髪のエルフ",
                "text": "速攻\n続唱 （あなたがこの呪文をプレイしたとき、あなたのライブラリーの一番上のカードを、コストがより低い土地でないカードが取り除かれるまでゲームから取り除く。 あなたはそれをそのマナ・コストを支払うことなくプレイしてもよい。 その取り除いたカードを、無作為の順番で一番下に置く。）"
            },
            {
                "flavor": null,
                "imageUrl": "http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=196582&type=card",
                "language": "Portuguese (Brazil)",
                "multiverseid": 196582,
                "name": "Elfo Tranças-de-Sangue",
                "text": "Ímpeto\nCascata (Quando jogar esta mágica, remova do jogo cards do topo de seu grimório até remover um que não seja terreno e que tenha custo inferior. Você pode jogá-lo sem pagar seu custo de mana. Coloque os cards removidos no fundo de forma aleatória.)"
            },
            {
                "flavor": null,
                "imageUrl": "http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=196002&type=card",
                "language": "Russian",
                "multiverseid": 196002,
                "name": "Кровавокосый Эльф",
                "text": "Ускорение\nКаскад (Когда вы разыгрываете это заклинание, удаляйте карты с верха вашей библиотеки из игры до тех пор, пока вы не удалите не являющуюся землей и стоящую меньше карту. Вы можете разыграть ее без уплаты ее мана-стоимости. Положите удаленные карты в низ вашей библиотеки в cлучайном порядке.)"
            },
            {
                "flavor": null,
                "imageUrl": "http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=196437&type=card",
                "language": "Chinese Simplified",
                "multiverseid": 196437,
                "name": "血辫地精",
                "text": "敏捷\n倾曳 （当你使用此咒语时，从你的牌库顶开始将牌移出对战，直到移出一张费用比此咒语低且不是地的牌为止。 你可以使用该牌，并且不需支付其法术力费用。 将所移出对战的牌以随机顺序置于牌库底。）"
            }
        ],
        "hand": null,
        "id": "ddf33648-4e92-518b-afdd-87028b868553",
        "image_url": "http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=185053&type=card",
        "layout": "normal",
        "legalities": [
            {
                "format": "Commander",
                "legality": "Legal"
            },
            {
                "format": "Duel",
                "legality": "Legal"
            },
            {
                "format": "Legacy",
                "legality": "Legal"
            },
            {
                "format": "Modern",
                "legality": "Legal"
            },
            {
                "format": "Vintage",
                "legality": "Legal"
            }
        ],
        "life": null,
        "loyalty": null,
        "mana_cost": "{2}{R}{G}",
        "multiverse_id": 185053,
        "name": "Bloodbraid Elf",
        "name_id": "Bloodbraid Elf_ddf33648-4e92-518b-afdd-87028b868553",
        "names": null,
        "number": "50",
        "original_text": "Haste\nCascade (When you play this spell, remove cards from the top of your library from the game until you remove a nonland card that costs less. You may play it without paying its mana cost. Put the removed cards on the bottom in a random order.)",
        "original_type": "Creature — Elf Berserker",
        "power": "3",
        "printings": [
            "ARB",
            "C16",
            "EMA",
            "F10",
            "PC2",
            "PCA",
            "PRM"
        ],
        "rarity": "Uncommon",
        "release_date": null,
        "rulings": [
            {
                "date": "2009-05-01",
                "text": "When the cascade ability resolves, you must exile cards. The only optional part of the ability is whether or not you cast the last card exiled."
            },
            {
                "date": "2009-05-01",
                "text": "If a spell with cascade is countered, the cascade ability will still resolve normally."
            },
            {
                "date": "2009-05-01",
                "text": "Cascade triggers when you cast the spell, meaning that it resolves before that spell. If you end up casting the exiled card, it will go on the stack above the spell with cascade."
            },
            {
                "date": "2009-05-01",
                "text": "If you cast the last exiled card, you’re casting it as a spell. It can be countered. If that card has cascade, the new spell’s cascade ability will trigger, and you’ll repeat the process for the new spell."
            },
            {
                "date": "2009-05-01",
                "text": "After you’re done exiling cards and casting the last one if you chose to do so, the remaining exiled cards are randomly placed on the bottom of your library. Neither you nor any other player is allowed to know the order of those cards."
            },
            {
                "date": "2009-05-01",
                "text": "You exile the cards face-up. All players will be able to see them."
            },
            {
                "date": "2017-04-18",
                "text": "The converted mana cost of a split card is determined by the combined mana cost of its two halves. If cascade allows you to cast a split card, you may cast either half but not both halves."
            }
        ],
        "set": "ARB",
        "set_name": "Alara Reborn",
        "source": null,
        "starter": null,
        "subtypes": [
            "Elf",
            "Berserker"
        ],
        "supertypes": [],
        "text": "Haste\nCascade (When you cast this spell, exile cards from the top of your library until you exile a nonland card that costs less. You may cast it without paying its mana cost. Put the exiled cards on the bottom of your library in a random order.)",
        "timeshifted": null,
        "toughness": "2",
        "type": "Creature — Elf Berserker",
        "types": [
            "Creature"
        ],
        "variations": null,
        "watermark": null
    }
]