[
    {
        "artist": "Tomasz Jedruszek",
        "border": null,
        "cmc": 6.0,
        "color_identity": [
            "U"
        ],
        "colors": [],
        "flavor": null,
        "foreign_names": [],
        "hand": null,
        "id": "110960eb-1b2c-54e9-ac4f-1f41012de8a5",
        "image_url": null,
        "layout": "normal",
        "legalities": [
            {
                "format": "Commander",
                "legality": "Legal"
            },
            {
                "format": "Duel",
                "legality": "Legal"
            },
            {
                "format": "Legacy",
                "legality": "Legal"
            },
            {
                "format": "Modern",
                "legality": "Legal"
            },
            {
                "format": "Penny",
                "legality": "Legal"
            },
            {
                "format": "Vintage",
                "legality": "Legal"
            }
        ],
        "life": null,
        "loyalty": null,
        "mana_cost": "{5}{U}",
        "multiverse_id": null,
        "name": "Drowner of Hope",
        "name_id": "Drowner of Hope_110960eb-1b2c-54e9-ac4f-1f41012de8a5",
        "names": null,
        "number": "57s",
        "original_text": null,
        "original_type": null,
        "power": "5",
        "printings": [
            "BFZ",
            "PBFZ",
            "PRM"
        ],
        "rarity": "Rare",
        "release_date": null,
        "rulings": [
            {
                "date": "2015-08-25",
                "text": "You can sacrifice any Eldrazi Scion to activate Drowner of Hope’s last ability, not just one created by Drowner of Hope."
            },
            {
                "date": "2015-08-25",
                "text": "You can’t sacrifice the same permanent to pay two different costs. Notably, if you sacrifice an Eldrazi Scion to activate the last ability of Drowner of Hope, you won’t add {C} to your mana pool."
            },
            {
                "date": "2015-08-25",
                "text": "Cards with devoid use frames that are variations of the transparent frame traditionally used for Eldrazi. The top part of the card features some color over a background based on the texture of the hedrons that once imprisoned the Eldrazi. This coloration is intended to aid deckbuilding and game play."
            },
            {
                "date": "2015-08-25",
                "text": "A card with devoid is just colorless. It’s not colorless and the colors of mana in its mana cost."
            },
            {
                "date": "2015-08-25",
                "text": "Other cards and abilities can give a card with devoid color. If that happens, it’s just the new color, not that color and colorless."
            },
            {
                "date": "2015-08-25",
                "text": "Devoid works in all zones, not just on the battlefield."
            },
            {
                "date": "2015-08-25",
                "text": "If a card loses devoid, it will still be colorless. This is because effects that change an object’s color (like the one created by devoid) are considered before the object loses devoid."
            },
            {
                "date": "2015-08-25",
                "text": "Eldrazi Scions are similar to Eldrazi Spawn, seen in the Zendikar block. Note that Eldrazi Scions are 1/1, not 0/1."
            },
            {
                "date": "2015-08-25",
                "text": "Eldrazi and Scion are each separate creature types. Anything that affects Eldrazi will affect these tokens, for example."
            },
            {
                "date": "2015-08-25",
                "text": "Sacrificing an Eldrazi Scion creature token to add {C} to your mana pool is a mana ability. It doesn’t use the stack and can’t be responded to."
            },
            {
                "date": "2015-08-25",
                "text": "Some instants and sorceries that create Eldrazi Scions require targets. If all targets for such a spell have become illegal by the time that spell tries to resolve, the spell won’t resolve and none of its effects will happen. You won’t get any Eldrazi Scions."
            }
        ],
        "set": "PBFZ",
        "set_name": "Battle for Zendikar Promos",
        "source": null,
        "starter": null,
        "subtypes": [
            "Eldrazi"
        ],
        "supertypes": [],
        "text": "Devoid (This card has no color.)\nWhen Drowner of Hope enters the battlefield, create two 1/1 colorless Eldrazi Scion creature tokens. They have \"Sacrifice this creature: Add {C}.\"\nSacrifice an Eldrazi Scion: Tap target creature.",
        "timeshifted": null,
        "toughness": "5",
        "type": "Creature — Eldrazi",
        "types": [
            "Creature"
        ],
        "variations": [
            "9f616e23-7a91-5210-a88b-3d02a0f2f8be"
        ],
        "watermark": null
    }
]