[
    {
        "artist": "Shelly Wan",
        "border": null,
        "cmc": 2.0,
        "color_identity": [
            "W"
        ],
        "colors": [
            "White"
        ],
        "flavor": "\"Our people are torn by infighting. Until the two sides reconcile, our laws can carry no meaning.\"",
        "foreign_names": [
            {
                "flavor": "„Unser Volk ist von internen Machtkämpfen zerrissen. Bis sich beide Seiten versöhnt haben, sind unsere Gesetze bedeutungslos.\"",
                "imageUrl": "http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=433305&type=card",
                "language": "German",
                "multiverseid": 433305,
                "name": "Leoniden-Schlichter",
                "text": "Spieler können keine Bibliotheken durchsuchen. Jeder Spieler kann {2} bezahlen, damit er diesen Effekt bis zum Ende des Zuges ignorieren darf."
            },
            {
                "flavor": "\"Nuestro pueblo está dividido por peleas internas. Hasta que ambos bandos se reconcilien, nuestras leyes no significarán nada\".",
                "imageUrl": "http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=433614&type=card",
                "language": "Spanish",
                "multiverseid": 433614,
                "name": "Árbitro leonino",
                "text": "Los jugadores no pueden buscar en las bibliotecas. Cualquier jugador puede pagar {2} para que ese jugador ignore este efecto hasta el final del turno."
            },
            {
                "flavor": "« Notre peuple est déchiré par les luttes internes. Tant que les deux camps ne se seront pas réconciliés, nos lois seront dépourvues de sens. »",
                "imageUrl": "http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=433923&type=card",
                "language": "French",
                "multiverseid": 433923,
                "name": "Arbitre léonin",
                "text": "Les joueurs ne peuvent pas chercher dans les bibliothèques. N'importe quel joueur peut payer {2} pour que ce joueur ignore cet effet jusqu'à la fin du tour."
            },
            {
                "flavor": "\"Il nostro popolo è dilaniato dalle lotte intestine. Finché le due fazioni non si riconciliano, le nostre leggi non hanno significato.\"",
                "imageUrl": "http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=434232&type=card",
                "language": "Italian",
                "multiverseid": 434232,
                "name": "Giudice Leonid",
                "text": "I giocatori non possono passare in rassegna i grimori. Qualsiasi giocatore può pagare {2} per ignorare questo effetto fino alla fine del turno."
            },
            {
                "flavor": "「我が人々は内紛に裂かれてしまった。両側が和睦するまで、我々の法は意味を成さない。」",
                "imageUrl": "http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=434541&type=card",
                "language": "Japanese",
                "multiverseid": 434541,
                "name": "レオニンの裁き人",
                "text": "プレイヤーはライブラリーから探せない。どのプレイヤーも{2}を支払ってもよい。そうしたなら、ターン終了時まで、そのプレイヤーはこの効果を無視する。"
            },
            {
                "flavor": "\"Nosso povo está dividido por lutas internas. Até que as duas partes se reconciliem, nossas leis não têm nenhum significado.\"",
                "imageUrl": "http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=434850&type=card",
                "language": "Portuguese (Brazil)",
                "multiverseid": 434850,
                "name": "Árbitro Leonino",
                "text": "Os jogadores não podem procurar em grimórios. Qualquer jogador pode pagar {2} para fazer com que aquele jogador ignore este efeito até o final do turno."
            }
        ],
        "hand": null,
        "id": "e0e43e62-f0a1-572c-aef8-1d8f30ab9bb4",
        "image_url": "http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=432996&type=card",
        "layout": "normal",
        "legalities": [
            {
                "format": "Commander",
                "legality": "Legal"
            },
            {
                "format": "Duel",
                "legality": "Legal"
            },
            {
                "format": "Legacy",
                "legality": "Legal"
            },
            {
                "format": "Modern",
                "legality": "Legal"
            },
            {
                "format": "Vintage",
                "legality": "Legal"
            }
        ],
        "life": null,
        "loyalty": null,
        "mana_cost": "{1}{W}",
        "multiverse_id": 432996,
        "name": "Leonin Arbiter",
        "name_id": "Leonin Arbiter_e0e43e62-f0a1-572c-aef8-1d8f30ab9bb4",
        "names": null,
        "number": "64",
        "original_text": "Players can't search libraries. Any player may pay {2} for that player to ignore this effect until end of turn.",
        "original_type": "Creature — Cat Cleric",
        "power": "2",
        "printings": [
            "C17",
            "SOM"
        ],
        "rarity": "Rare",
        "release_date": null,
        "rulings": [
            {
                "date": "2011-01-01",
                "text": "If an effect says “You may search your library . . . If you do, shuffle your library,” and you haven’t paid {2}, you can’t choose to search, so you won’t shuffle."
            },
            {
                "date": "2011-01-01",
                "text": "If an effect says “Search your library . . . Then shuffle your library,” and you haven’t paid {2}, the search effect fails, but you will still have to shuffle."
            },
            {
                "date": "2011-01-01",
                "text": "Since players who haven’t paid {2} can’t search, they won’t be able to find any cards in a library. The effect applies to all players and all libraries. If a spell or ability’s effect has other parts that don’t depend on searching for or finding cards, they will still work normally."
            },
            {
                "date": "2011-01-01",
                "text": "Effects that tell a player to reveal cards from a library or look at cards from the top of a library will still work. Only effects that use the word “search” will fail unless a player pays {2}."
            },
            {
                "date": "2011-01-01",
                "text": "Paying {2} to ignore Leonin Arbiter’s effect is a special action. Any player may take this special action any time they have priority. It doesn’t use the stack and can’t be responded to."
            },
            {
                "date": "2011-01-01",
                "text": "Paying {2} doesn’t let a player pick up a library and search it — it just allows them to ignore Leonin Arbiter’s effect that turn. That player can search a library only if another spell or ability instructs them to do so."
            },
            {
                "date": "2011-01-01",
                "text": "If a player pays {2}, that enables only them to ignore Leonin Arbiter’s effect that turn. Each other player is still affected by it."
            },
            {
                "date": "2011-01-01",
                "text": "A player who has paid {2} may search any library when instructed to do so that turn, not just their own library."
            },
            {
                "date": "2011-01-01",
                "text": "Once a player has paid {2}, they may search libraries that turn as many times as they are instructed to do so."
            },
            {
                "date": "2011-01-01",
                "text": "If there are multiple Leonin Arbiters on the battlefield, a player must pay {2} for each one before being able to search libraries that turn."
            }
        ],
        "set": "C17",
        "set_name": "Commander 2017",
        "source": null,
        "starter": null,
        "subtypes": [
            "Cat",
            "Cleric"
        ],
        "supertypes": [],
        "text": "Players can't search libraries. Any player may pay {2} for that player to ignore this effect until end of turn.",
        "timeshifted": null,
        "toughness": "2",
        "type": "Creature — Cat Cleric",
        "types": [
            "Creature"
        ],
        "variations": null,
        "watermark": null
    }
]