[
    {
        "artist": "Jung Park",
        "border": null,
        "cmc": 0.0,
        "color_identity": [
            "B",
            "W"
        ],
        "colors": [],
        "flavor": null,
        "foreign_names": [],
        "hand": null,
        "id": "b4cd468b-29db-5a3a-9762-fc30058ee478",
        "image_url": null,
        "layout": "normal",
        "legalities": [
            {
                "format": "Commander",
                "legality": "Legal"
            },
            {
                "format": "Duel",
                "legality": "Legal"
            },
            {
                "format": "Legacy",
                "legality": "Legal"
            },
            {
                "format": "Modern",
                "legality": "Legal"
            },
            {
                "format": "Vintage",
                "legality": "Legal"
            }
        ],
        "life": null,
        "loyalty": null,
        "mana_cost": null,
        "multiverse_id": null,
        "name": "Shambling Vent",
        "name_id": "Shambling Vent_b4cd468b-29db-5a3a-9762-fc30058ee478",
        "names": null,
        "number": "244s",
        "original_text": null,
        "original_type": null,
        "power": null,
        "printings": [
            "BFZ",
            "PBFZ"
        ],
        "rarity": "Rare",
        "release_date": null,
        "rulings": [
            {
                "date": "2015-08-25",
                "text": "multiple instances of lifelink on the same creature are redundant. Activating the last ability more than once won’t cause you to gain additional life if Shambling Vent deals damage."
            },
            {
                "date": "2015-08-25",
                "text": "A land that becomes a creature may be affected by “summoning sickness.” You can’t attack with it or use any of its {T} abilities (including its mana abilities) unless it began your most recent turn on the battlefield under your control. Note that summoning sickness cares about when that permanent came under your control, not when it became a creature nor when it entered the battlefield."
            },
            {
                "date": "2015-08-25",
                "text": "This land is colorless until the last ability gives it colors."
            },
            {
                "date": "2015-08-25",
                "text": "When a land becomes a creature, that doesn’t count as having a creature enter the battlefield. The permanent was already on the battlefield; it only changed its types. Abilities that trigger whenever a creature enters the battlefield won’t trigger."
            },
            {
                "date": "2015-08-25",
                "text": "An ability that turns a land into a creature also sets that creature’s power and toughness. If the land was already a creature (for example, if it was the target of a spell with awaken), this will overwrite the previous effect that set its power and toughness. Effects that modify its power or toughness will continue to apply no matter when they started to take effect. The same is true for counters that change its power or toughness (such as +1/+1 counters) and effects that switch its power and toughness. For example, if Shambling Vent has been made a 0/0 creature with three +1/+1 counters on it, activating its last ability will turn it into a 5/6 creature that’s still a land."
            }
        ],
        "set": "PBFZ",
        "set_name": "Battle for Zendikar Promos",
        "source": null,
        "starter": null,
        "subtypes": [],
        "supertypes": [],
        "text": "Shambling Vent enters the battlefield tapped.\n{T}: Add {W} or {B}.\n{1}{W}{B}: Shambling Vent becomes a 2/3 white and black Elemental creature with lifelink until end of turn. It's still a land.",
        "timeshifted": null,
        "toughness": null,
        "type": "Land",
        "types": [
            "Land"
        ],
        "variations": null,
        "watermark": null
    }
]